app/controllers/comments_controller.rb

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`body`, `created_at`, `name`, `post_id`, `updated_at`) VALUES (NULL, '2011-11-18 15:25:59', NULL, 1, '2011-11-18 15:25:59')
---
  def create
    @post = Post.find(params[:id])
    @comment = @post.comments.create!(params[:comment])